-- Toggles IPA bindings
local M = {}

M.mappings = {
	[",nn"] = "ɲ̊",
	[",gn"] = "ɲ",
	[",ng"] = "ŋ",
	[",\'"] = "ʔ",
	[",sh"] = "ʃ",
	[",zh"] = "ʒ",
	[",xi"] = "ɕ",
	[",zi"] = "ʑ",
	[",ph"] = "ɸ",
	[",bh"] = "β",
	[",th"] = "θ",
	[",dh"] = "ð",
	[",cc"] = "ç",
	[",jj"] = "ʝ",
	[",gh"] = "ɣ",
	[",xx"] = "χ",
	[",fr"] = "ʁ",
	[",HH"] = "ħ",
	[",hh"] = "ɦ",
	[",vv"] = "ʋ",
	[",er"] = "ɹ",
	[",fl"] = "ɾ",
	[",bb"] = "ʙ",
	[",ih"] = "ɨ",
	[",ii"] = "ɪ",
	[",eu"] = "ɯ̽",
	[",uu"] = "ʊ",
	[",uh"] = "ə",
	[",eh"] = "ɛ",
	[",oe"] = "œ",
	[",au"] = "ɔ",
	[",ae"] = "æ",
	[",aa"] = "ɐ",
	[",OE"] = "ɶ",
	[",ah"] = "ɑ",
	[",ba"] = "ɒ"
}

return M
